'''
难度等级 II
实现选择排序

实现原理：
　设第一个元素为比较元素，依次和后面的元素比较，比较完所有元素找到最小的元素，将它和第一个元素互换
　重复上述操作，我们找出第二小的元素和第二个位置的元素互换，以此类推找出剩余最小元素将它换到前面，即完成排序

算法描述：
1. 在一个长度为 N 的无序数组中，第一次遍历 n-1 个数找到最小的和第一个数交换。
2. 第二次从下一个数开始遍历 n-2 个数，找到最小的数和第二个数交换。
3. 重复以上操作直到第 n-1 次遍历最小的数和第 n-1 个数交换，排序完成。
'''

'''
难度等级 II
实现用户登录系统，用户名密码正确，提示登录成功，用户名密码不匹配，提示密码错误，你还有几次登录机会    当用户输入三次密码时，提示不能登录,
用户名，密码存放在字典中 user_dict= {"cc":"123123","小牛":"123123"}
'''


'''
难度等级 II
有文件 a.txt(内容不为空，且有多行)
要求：找出出现次数最多的字符
'''


'''
难度等级 III
实现算法，找出 列表中第二大的数, 
如列表 [3,5,2,8,4,7,9] 第二大的数是 8
'''


'''
难度II
自习部分

1. 掌握 python 中的文件操作
'''